Show / Hide Table of Contents
Class BentUpBar
Representing bent-Up bar in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
BentUpBar
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class BentUpBar : ReinforcementGroup
Constructors
Improve this Doc   View Source
BentUpBar()
Constructor
Declaration
public BentUpBar()
Properties
Improve this Doc   View Source
AddAnchor
Add anchor to bent up bar
Declaration
public bool AddAnchor { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Angle
Angle between bar and master edge
Declaration
public double Angle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AnchorLength
Length of anchor for bent up bar
Declaration
public double AnchorLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BottomLength
Length of additional bar on the bottom
Declaration
public double BottomLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
IsOnLeft
Bar is on left or right side of member1D
Declaration
public bool IsOnLeft { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MasterComponent
Master component of reinforcement
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Offset
Offset of bent-Up bar from left/right edge
Declaration
public double Offset { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
TopLength
Length of additional bar on the top
Declaration
public double TopLength { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source